As of version v1.1.0, this issue is no longer reproducible. Closing with the comment.
```
Terraform used the selected providers to generate the following execution plan. Resource actions
are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # awscc_bedrock_guardrail.example will be created
  + resource "awscc_bedrock_guardrail" "example" {
      + blocked_input_messaging             = "Blocked input"
      + blocked_outputs_messaging           = "blocked output"
      + content_policy_config               = (known after apply)
      + created_at                          = (known after apply)
      + description                         = "Example guardrail"
      + failure_recommendations             = (known after apply)
      + guardrail_arn                       = (known after apply)
      + guardrail_id                        = (known after apply)
      + id                                  = (known after apply)
      + kms_key_arn                         = (known after apply)
      + name                                = "example_guardrail"
      + sensitive_information_policy_config = {
          + pii_entities_config = [
              + {
                  + action = "BLOCK"
                  + type   = "NAME"
                },
              + {
                  + action = "BLOCK"
                  + type   = "DRIVER_ID"
                },
              + {
                  + action = "ANONYMIZE"
                  + type   = "USERNAME"
                },
            ]
          + regexes_config      = (known after apply)
        }
      + status                              = (known after apply)
      + status_reasons                      = (known after apply)
      + tags                                = (known after apply)
      + topic_policy_config                 = (known after apply)
      + updated_at                          = (known after apply)
      + version                             = (known after apply)
      + word_policy_config                  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
awscc_bedrock_guardrail.example: Creating...
awscc_bedrock_guardrail.example: Creation complete after 6s [id=arn:aws:bedrock:us-east-1:############:guardrail/kb9u3wkca3rf]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```